IMPORTING PANDAS LIBRARY

In [1]:
import pandas as pd

READING THE DATASET

In [2]:
data_existing = pd.read_csv('existing house sales.csv')

DATASET

In [3]:
data_existing

       MONTH       VALUE
0    2003-01   80.322599
1    2003-02         NaN
2    2003-03         NaN
3    2003-04   79.406230
4    2003-05         NaN
..       ...         ...
235  2022-08         NaN
236  2022-09         NaN
237  2022-10  180.783512
238  2022-11         NaN
239  2022-12         NaN

[240 rows x 2 columns]

LINEAR INTERPOLATION TO FILL VALUES

In [4]:
data_existing['VALUE'].interpolate(method='linear', inplace=True)

SAVING DATASET

In [7]:
data_existing.to_excel('EXISTING HOUSE SALES MONTHLY.xlsx')

SIMILAR APPROACH FOR NEXT DATASET

In [9]:
data_housing = pd.read_excel('housing credit availability index.xlsx',sheet_name='Sheet2')

In [10]:
data_housing

         MONTH      VALUE
0   2003-01-01  17.230836
1   2003-02-01        NaN
2   2003-03-01        NaN
3   2003-04-01  16.862748
4   2003-05-01        NaN
..         ...        ...
235 2022-08-01        NaN
236 2022-09-01        NaN
237 2022-10-01   3.089000
238 2022-11-01        NaN
239 2022-12-01        NaN

[240 rows x 2 columns]

In [11]:
data_housing['VALUE'].interpolate(method='linear', inplace=True)

In [12]:
data_housing.to_excel('housing credit availability index MONTHLY.xlsx')